{"posts":[
{
    "id": "human-side-ai-age",
    "title": "The Human Side of the AI Age: How Seekive Brings Purpose to a World That's Changing Fast",
    "date": "2025-10-06",
    "category": "Future",
    "author": "Seekive",
    "content": [
        "We're entering an age unlike any before it. Artificial Intelligence is transforming how we work, learn, and create — reshaping the rhythms of daily life faster than most can process.",
        "Soon, millions will find themselves with more time and fewer routines. AI will handle the tasks that once filled our days — writing, scheduling, organizing, even deciding. But when technology takes over the 'doing,' the question becomes: What do we live for?"
    ],
    "fullArticleUrl": "/latest/human-side-ai-age/"
}
,
{
    "id": "finding-purpose-ai-age",
    "title": "The Human Side of the AI Age: How Seekive Helps Us Find Purpose When Machines Take Over the Work",
    "date": "2025-10-06",
    "category": "Future",
    "author": "Seekive",
    "content": [
        "Artificial Intelligence is reshaping everything — how we work, learn, create, and even think. For the first time in history, many people are facing a future where machines can do nearly everything they once did.",
        "AI promises freedom, but it also stirs an ancient fear: If machines take over the doing, what happens to the meaning? Seekive was created to help answer that — by giving purpose, direction, and discovery back to people in a world where the boundaries between human and machine are shifting fast."
    ],
    "fullArticleUrl": "/latest/finding-purpose-ai-age/"
}
,
{
    "id": "problems-we-solve",
    "title": "The Problems Seekive Helps to Solve",
    "date": "2025-09-30",
    "category": "Vision",
    "author": "Seekive",
    "content": [
        "We live in a time of endless possibilities. Entertainment, events, food, nature, adventures — the world is overflowing with opportunities. Yet many of us feel stuck in routines, disconnected from our communities, or overwhelmed by too many choices.",
        "Seekive was built to change that. It’s not just another app. It's a tool for discovery, connection, and resilience, designed for everyday life and the world that’s coming tomorrow."
    ],
    "fullArticleUrl": "/latest/problems-we-solve/"
}
,
{
    "id": "testing-latest-page",
    "title": "Testing the Latest Page",
    "date": "2025-09-08",
    "category": "Testing",
    "author": "Marc Shave, Seekive",
    "content": [
    "Just testing out this new blog section to make sure everything works as expected. Posts should flow nicely down the page with the right spacing and styling.",
    "This is what a typical post will look like once I start sharing regular updates about the Seekive journey."
  ]
}
]}
